{
  "Afghanistan": {
    "bird": "Golden Eagle",
    "fact": "Afghanistan is home to part of the ancient Silk Road and contains high mountain ranges like the Hindu Kush."
  },
  "Albania": {
    "bird": "Golden Eagle",
    "fact": "Albania has an extensive coastline along the Adriatic and Ionian Seas and many well-preserved Byzantine sites."
  },
  "Algeria": {
    "bird": "Fennec Fox (national animal) — Commonly associated; national bird often cited as the North African ostrich",
    "fact": "Algeria is the largest country in Africa by land area and contains large portions of the Sahara Desert."
  },
  "Andorra": {
    "bird": "Bearded Vulture (Lammergeier) — Regionally symbolic",
    "fact": "Andorra is a small, mountainous country in the Pyrenees between France and Spain and is famous for its ski resorts."
  },
  "Angola": {
    "bird": "Goliath Heron",
    "fact": "Angola has diverse landscapes from Atlantic coastline to highlands and large national parks like Kissama National Park."
  },
  "Antigua and Barbuda": {
    "bird": "Antiguan Racer (actually a snake) — common national animal; national bird often cited as the frigatebird",
    "fact": "Antigua has 365 beaches—one for each day of the year—making it a popular Caribbean destination."
  },
  "Argentina": {
    "bird": "Rufous Hornero",
    "fact": "Argentina is the largest Spanish-speaking country by land area and home to diverse regions from Patagonia to Iguazú Falls."
  },
  "Armenia": {
    "bird": "Armenian Hoopoe",
    "fact": "Armenia is one of the oldest Christian civilizations and home to ancient monasteries like Geghard and Tatev."
  },
  "Australia": {
    "bird": "Emu",
    "fact": "Australia is a continent-country with unique wildlife—over 80% of its mammals and reptiles are endemic."
  },
  "Austria": {
    "bird": "Lammergeier / Bearded Vulture (symbolic in alpine regions)",
    "fact": "Austria is renowned for its musical heritage (Mozart, Strauss) and alpine scenery with historic cities like Vienna and Salzburg."
  },
  "Azerbaijan": {
    "bird": "Golden Eagle (regionally symbolic)",
    "fact": "Azerbaijan stretches from the Caspian Sea to the Caucasus mountains and is known for its oil reserves and 'flame' motifs."
  },
  "Bahamas": {
    "bird": "Flamingo (Great Bahamas)",
    "fact": "The Bahamas is an archipelago of over 700 islands and is known for blue holes and clear turquoise waters."
  },
  "Bahrain": {
    "bird": "Saker Falcon (regional hunting bird)",
    "fact": "Bahrain is an island nation in the Persian Gulf, historically an important trading and pearling center."
  },
  "Bangladesh": {
    "bird": "Magpie Robin (Doyel)",
    "fact": "Bangladesh has one of the world's largest river deltas and the Sundarbans, the world's largest mangrove forest home to Bengal tigers."
  },
  "Barbados": {
    "bird": "Brown Pelican",
    "fact": "Barbados is a Caribbean island nation with a strong cultural heritage and Bridgetown is a UNESCO World Heritage site."
  },
  "Belarus": {
    "bird": "White Stork",
    "fact": "Belarus features vast forests and lakes; Mir and Nesvizh castles are UNESCO-listed historical sites."
  },
  "Belgium": {
    "bird": "Black Woodpecker (symbolic); national bird commonly cited as the Common Blackbird",
    "fact": "Belgium hosts many international institutions and is famous for chocolate, waffles, and historic cities like Bruges and Brussels."
  },
  "Belize": {
    "bird": "Keel-billed Toucan (symbolic)",
    "fact": "Belize has the second largest barrier reef in the world and extensive Mayan ruins inland."
  },
  "Benin": {
    "bird": "Marabou Stork (common large bird)",
    "fact": "Benin was the birthplace of the historical Kingdom of Dahomey and is an important West African cultural center."
  },
  "Bhutan": {
    "bird": "Ruddy Shelduck (symbolic); Black-necked Crane (important in highlands)",
    "fact": "Bhutan measures prosperity by Gross National Happiness and maintains a strong commitment to preserving its culture and environment."
  },
  "Bolivia": {
    "bird": "Andean Cock-of-the-rock",
    "fact": "Bolivia includes diverse landscapes from the Andes to the Amazon and contains Lake Titicaca, the highest navigable lake."
  },
  "Bosnia and Herzegovina": {
    "bird": "Golden Eagle (regional symbol)",
    "fact": "Bosnia and Herzegovina features Ottoman and Austro-Hungarian heritage seen in cities like Sarajevo and Mostar."
  },
  "Botswana": {
    "bird": "Kori Bustard",
    "fact": "Botswana is home to the Okavango Delta, one of the world's largest inland deltas and a wildlife-rich wilderness."
  },
  "Brazil": {
    "bird": "Rufous-bellied Thrush",
    "fact": "Brazil contains much of the Amazon rainforest and is the largest country in South America by area and population."
  },
  "Brunei": {
    "bird": "Bristlehead (local iconic bird)",
    "fact": "Brunei is a small, wealthy sultanate on Borneo known for oil and gas wealth and preserved rainforests."
  },
  "Bulgaria": {
    "bird": "Eastern Imperial Eagle",
    "fact": "Bulgaria has ancient Thracian heritage and the Rila Monastery, and is known for its rose valley and Balkans mountains."
  },
  "Burkina Faso": {
    "bird": "Black-bellied Bustard (regionally notable)",
    "fact": "Burkina Faso is a landlocked West African country known for its music, arts festivals, and Sahelian landscapes."
  },
  "Burundi": {
    "bird": "Shoebill (in regional wetlands) — commonly noted in Great Lakes region",
    "fact": "Burundi is a small East African country in the African Great Lakes region with rich cultural traditions."
  },
  "Cabo Verde": {
    "bird": "Iago Sparrow (Cape Verde Sparrow)",
    "fact": "Cabo Verde (Cape Verde) is an island nation off the West African coast known for Creole Portuguese-African culture and music."
  },
  "Cambodia": {
    "bird": "Giant Ibis (national bird)",
    "fact": "Cambodia is home to the Angkor Wat temple complex, one of the world's largest religious monuments."
  },
  "Cameroon": {
    "bird": "Fountain Warbler (symbolic) / African grey parrot in region",
    "fact": "Cameroon is sometimes called 'Africa in miniature' due to its geological and cultural diversity."
  },
  "Canada": {
    "bird": "Gray Jay (Canada Jay) — often used as a national bird; officially the gray jay",
    "fact": "Canada has the longest coastline in the world and vast boreal forests stretching across the country."
  },
  "Central African Republic": {
    "bird": "African Grey Parrot (regional iconic species)",
    "fact": "The Central African Republic includes dense rainforest regions and important wildlife habitats in Central Africa."
  },
  "Chad": {
    "bird": "Sociable Lapwing (regionally observed) / Ostrich species historic",
    "fact": "Chad contains part of the Sahara Desert in the north and the productive Lake Chad basin in the southwest."
  },
  "Chile": {
    "bird": "Andean Condor",
    "fact": "Chile is a very long, narrow country stretching from the dry Atacama Desert to the glaciers of Patagonia."
  },
  "China": {
    "bird": "Red-crowned Crane",
    "fact": "China is the world's most populous country and home to a wide range of landscapes from deserts to mountains and river valleys."
  },
  "Colombia": {
    "bird": "Andean Cock-of-the-rock (national bird for Andean region) / Andean condor also important",
    "fact": "Colombia is one of the most biodiverse countries in the world per square kilometer and hosts part of the Amazon rainforest."
  },
  "Comoros": {
    "bird": "Comoro Olive Pigeon (regionally notable)",
    "fact": "Comoros is an archipelago in the Indian Ocean with volcanic islands and strong Swahili-influenced culture."
  },
  "Congo (Republic of the Congo)": {
    "bird": "African Grey Parrot (regionally iconic)",
    "fact": "The Republic of the Congo contains extensive tropical rainforest and is part of the Congo Basin."
  },
  "Congo (Democratic Republic of the Congo)": {
    "bird": "Okapi (national mammal), regional birds include African grey parrot — exceptional biodiversity",
    "fact": "DR Congo is one of Africa's largest countries and contains large portions of the Congo rainforest, an incredibly biodiverse region."
  },
  "Costa Rica": {
    "bird": "Yigüirro (Clay-colored Thrush) — national bird",
    "fact": "Costa Rica is famed for its biodiversity and pioneering conservation efforts, protecting about a quarter of its land as reserves."
  },
  "Côte d'Ivoire": {
    "bird": "Hooded Vulture (regional) / Northern red-billed hornbill",
    "fact": "Also known as Ivory Coast, the country is a leading producer of cocoa and has diverse forests and savannahs."
  },
  "Croatia": {
    "bird": "Common Nightingale (symbolic)",
    "fact": "Croatia has a long Adriatic coastline with many islands and historic cities like Dubrovnik with well-preserved medieval walls."
  },
  "Cuba": {
    "bird": "Tocororo (Cuban Trogon) — national bird",
    "fact": "Cuba is the largest island nation in the Caribbean and has a rich musical and revolutionary history."
  },
  "Cyprus": {
    "bird": "Cyprus Wheatear (symbolic)",
    "fact": "Cyprus is a Mediterranean island with ancient history and mixed Greek and Turkish cultural influences."
  },
  "Czech Republic": {
    "bird": "Common Nightingale (symbolic in region)",
    "fact": "The Czech Republic is known for its historic architecture, castles, and beer-brewing tradition (Czech pilsner)."
  },
  "Denmark": {
    "bird": "Mute Swan (symbolic)",
    "fact": "Denmark is part of the Scandinavian region and is known for design, high quality of life, and historic Copenhagen."
  },
  "Djibouti": {
    "bird": "Somali Ostrich (regionally notable)",
    "fact": "Djibouti sits at the entrance to the Red Sea and is strategically located near key shipping lanes."
  },
  "Dominica": {
    "bird": "Sisserou Parrot (Imperial Amazon) — national bird",
    "fact": "Dominica is known as the 'Nature Island' of the Caribbean with volcanic landscapes and abundant rainforests."
  },
  "Dominican Republic": {
    "bird": "Palmchat (national bird)",
    "fact": "The Dominican Republic shares the island of Hispaniola with Haiti and has a rich colonial history and beaches."
  }
}
